src/Trade/cf/Catalogs/ВходящиеСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВходящиеСообщения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОчереди</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Trade/cf/Catalogs/ВходящиеСообщения/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ПрочитатьСообщенияИзОчереди() Экспорт
	
	КлиентКомпоненты = Справочники.НастройкиОбменаСообщениями.ПолучитьКомпонентуСервер();
	НастройкиПодключенияПоУмолчанию = Справочники.НастройкиОбменаСообщениями.НастройкиПодключенияПоУмолчанию();

	Попытка
		КлиентКомпоненты.Connect(
			НастройкиПодключенияПоУмолчанию.Адрес,
			НастройкиПодключенияПоУмолчанию.Порт,
			НастройкиПодключенияПоУмолчанию.Логин,
			НастройкиПодключенияПоУмолчанию.Пароль,
			НастройкиПодключенияПоУмолчанию.ВиртуальныйХост);
			
			Попытка
				
				Для Каждого Очередь Из НастройкиПодключенияПоУмолчанию.ВходящиеОчереди Цикл	
					
					ИмяОчереди = Очередь;
					
					Потребитель = КлиентКомпоненты.BasicConsume(ИмяОчереди, "", Истина, Ложь, 0);
					
					ОтветноеСообщение = ""; 
					
					Пока КлиентКомпоненты.BasicConsumeMessage("", ОтветноеСообщение, 500) Цикл
						Попытка 
							ЗаписатьВходящееСообщение(ОтветноеСообщение, ИмяОчереди);
							КлиентКомпоненты.BasicAck();	
						Исключение
							
						КонецПопытки; 
						ОтветноеСообщение = ""; 
					КонецЦикла;
						
				КонецЦикла;
				
				КлиентКомпоненты.BasicCancel("");
				
			Исключение
				ВызватьИсключение КлиентКомпоненты.GetLastError();
			КонецПопытки;

	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка чтения сообщения!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
	
	
КонецПроцедуры 

Процедура ОбработатьСообщения() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 5
	|	ВходящиеСообщения.Ссылка КАК Ссылка,
	|	ВходящиеСообщения.Обработано КАК Обработано,
	|	ВходящиеСообщения.ТекстСообщения КАК ТекстСообщения
	|ИЗ
	|	Справочник.ВходящиеСообщения КАК ВходящиеСообщения
	|ГДЕ
	|	ВходящиеСообщения.Обработано = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Попытка
			ОбработатьОбъектВбазе(ВыборкаДетальныеЗаписи.ТекстСообщения);
			СообщениеОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			СообщениеОбъект.Обработано = Истина;
			СообщениеОбъект.Записать();
		Исключение
			// чего то там записал в логи
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьВходящееСообщение(ОтветноеСообщение, ИмяОчереди)
	
	ВходящееСообщение = Справочники.ВходящиеСообщения.СоздатьЭлемент();	
	ВходящееСообщение.ТекстСообщения = ОтветноеСообщение;
	ВходящееСообщение.ИмяОчереди = ИмяОчереди;
	ВходящееСообщение.Записать();	
	
КонецПроцедуры

Процедура ОбработатьОбъектВбазе(ТелоСообщения)
	
	// Тут какая- то супер оптимальная логика расшифровки, но не сегодня	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТелоСообщения);
	
	Объект = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON, Тип("Структура"));	
	
	Если Объект.ПолноеИмяОбъектаМетаданных = "РегистрСведений.СтатусыДокументов" Тогда
		РегистрыСведений.СтатусыДокументов.ЗагрузитьСтатусы(Объект);	
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
